using System;

namespace pz_16
    /*Пользователь вводит целое неотрицательное число N, программа с помощью процедур
должна рассчитать и вывести площадь окружности с радиусом N, объем и площадь сфер с
радиусом N*/
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
