using System;

namespace pz_17
    /*Реализуйте метод, принимающий в качестве параметра целое число n и возвращающий
массив размерности [n,n], заполненный по правилу: элементы главной и побочной диагонали
= ‘*’, пересечение диагоналей = ‘o’, остальные элементы заполнены пробелами.*/
{
    class Program
    {
        static void Main(string[] args)
        {
            Console.WriteLine("Hello World!");
        }
    }
}
